Documents/УправлениеПеней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеПеней</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействиеПени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УправлениеПеней/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеУслугами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст =
       "ВЫБРАТЬ
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание,
       |	УправлениеПенейЛицевыеСчета.Ссылка.ДатаНачала КАК Период,
       |	ЛОЖЬ КАК Действует
       |ИЗ
       |	Документ.УправлениеПеней.ЛицевыеСчета КАК УправлениеПенейЛицевыеСчета
       |ГДЕ
       |	УправлениеПенейЛицевыеСчета.Ссылка = &Ссылка
       |
       |СГРУППИРОВАТЬ ПО
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	УправлениеПенейЛицевыеСчета.Ссылка.ДатаНачала,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание,
       |	КОНЕЦПЕРИОДА(УправлениеПенейЛицевыеСчета.Ссылка.ДатаОкончания, ДЕНЬ),
       |	ИСТИНА
       |ИЗ
       |	Документ.УправлениеПеней.ЛицевыеСчета КАК УправлениеПенейЛицевыеСчета
       |ГДЕ
       |	УправлениеПенейЛицевыеСчета.Ссылка = &Ссылка
       |
       |СГРУППИРОВАТЬ ПО
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание,
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	КОНЕЦПЕРИОДА(УправлениеПенейЛицевыеСчета.Ссылка.ДатаОкончания, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеУслугами);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДействиеПени", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
